recipes/vegan-palak-paneer.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Vegan Palak Paneer</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Vegan Palak Paneer</h1>
<p>
<a href="https://minimalistbaker.com/vegan-palak-paneer-with-curried-tofu/">Original link</a>
</p>

<div id="outline-container-orgfa8cf93" class="outline-2">
<h2 id="orgfa8cf93">Ingredients</h2>
<div class="outline-text-2" id="text-orgfa8cf93">
</div>
<div id="outline-container-org92008f8" class="outline-3">
<h3 id="org92008f8">Tofu</h3>
<div class="outline-text-3" id="text-org92008f8">
<ul class="org-ul">
<li>1 450g block firm tofu (drained, patted dry, and cubed)</li>
<li>1 1/2 tsp curry powder (or store-bought)</li>
<li>1 Tbsp coconut aminos</li>
<li>1/4 tsp sea salt</li>
<li>2 tsp nutritional yeast (adds a slightly cheesy flavor)</li>
</ul>
</div>
</div>

<div id="outline-container-orgd43c11a" class="outline-3">
<h3 id="orgd43c11a">Spinach</h3>
<div class="outline-text-3" id="text-orgd43c11a">
<ul class="org-ul">
<li>5 cups loosely packed fresh spinach (about 170g)</li>
<li>Water</li>
</ul>
</div>
</div>

<div id="outline-container-org8b71eb3" class="outline-3">
<h3 id="org8b71eb3">Vegetables</h3>
<div class="outline-text-3" id="text-org8b71eb3">
<ul class="org-ul">
<li>1 1/2 Tbsp avocado or coconut oil (or sub water + add more as needed)</li>
<li>1 1/2 tsp cumin seed (or ground cumin)</li>
<li>2 Tbsp minced ginger</li>
<li>1 medium diced white onion</li>
<li>1 serrano or jalapeno pepper (seeds removed, diced // add more or less to preferred spiciness)</li>
<li>1 can diced tomatoes (slightly drained // or sub fresh chopped ripe tomatoes)</li>
<li>4 cloves garlic</li>
<li>1/4-1/2 cup vegetable broth or water</li>
</ul>
</div>
</div>

<div id="outline-container-org6f68839" class="outline-3">
<h3 id="org6f68839">Sauce</h3>
<div class="outline-text-3" id="text-org6f68839">
<ul class="org-ul">
<li>1 1/2 Tbsp avocado or coconut oil (or sub water + add more as needed)</li>
<li>2 tsp curry powder</li>
<li>1 tsp garam masala</li>
<li>1/3 cup full fat coconut milk (plus more for serving)</li>
<li>Sea salt, coconut aminos, or tamari (to taste // we used a few teaspoons of coconut aminos)</li>
</ul>
</div>
</div>

<div id="outline-container-org831586d" class="outline-3">
<h3 id="org831586d">For serving (optional)</h3>
<div class="outline-text-3" id="text-org831586d">
<ul class="org-ul">
<li>Rice or Quinoa</li>
<li>Cilantro</li>
<li>Garlic Naan</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org63631a6" class="outline-2">
<h2 id="org63631a6">Method</h2>
<div class="outline-text-2" id="text-org63631a6">
<ol class="org-ol">
<li>This recipe is all about multi-tasking and is totally doable in 30 minutes.
Start by preheating the oven to 210°C and draining your tofu. Then wrap in
a clean towel and set something heavy on top. (This step can also be done
in advance with a tofu press.)</li>
<li>Cube tofu and add to a medium mixing bowl. Season with curry powder,
coconut aminos, sea salt, and nutritional yeast. Shake the bowl to gently
toss. Set aside.</li>
<li>Heat a medium oven-safe seasoned cast iron over medium heat (if using a
stainless steel skillet, add a little oil so it doesn't stick). Once hot,
add the tofu and saute for 3-4 minutes, or until a couple of the sides are
browned. Then transfer to the hot oven and bake for 15 minutes. If you
prefer firmer tofu, bake longer. If you want softer tofu that mocks paneer,
bake less. Set aside to rest in the pan.</li>
<li>Fill a large pot halfway full with water and bring to a boil over high
heat. While you wait, move on to the next step.</li>
<li>Heat a large rimmed skillet over medium heat. Once hot, add oil and cumin
seed, ginger, onion, and serrano pepper. Saute until onion is soft and
translucent (about 5 minutes).</li>
<li>Add diced tomatoes and garlic and stir to combine. Saute for 3-4 minutes,
or until the tomato has softened.</li>
<li>Your water should be boiling now. Add spinach and cook uncovered for 2
minutes. Then strain and rinse with cold water. Drain well. Set aside.</li>
<li>Add the tomato mixture to a blender or food processor along with cooked
drained spinach and the vegetable broth (or water). Blend into a smooth
sauce, scraping down sides as needed. If it has trouble blending, add more
vegetable broth or water.</li>
<li>Lastly, cook your sauce. Heat the same rimmed skillet from earlier over
medium heat. Once hot, add remaining oil (or some water), curry powder, and
garam masala. Stir and cook for 30 seconds.</li>
<li>Add the spinach sauce and stir. Cook the mixture over medium-low heat for
about 3-4 minutes to deepen the flavors. If it bubbles too much, lower
heat to a simmer. Then add coconut milk and stir.</li>
<li>Taste and adjust flavor as needed, adding salt or coconut aminos to deepen
the flavor and curry powder for more rich curry flavor.</li>
<li>Serve over your tofu paneer and garnish with another drizzle of full fat
coconut milk and fresh cilantro. Rice makes a lovely side, as does garlic
naan! Store leftovers covered in the refrigerator up to 4-5 days, or in
the freezer up to 1 month. Reheat in the microwave or in a rimmed skillet
until hot.</li>
</ol>
</div>
</div>
</div>
</body>
</html>
